In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('CSVs/titanic/train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Resumo Estatístico de Campos Numéricos

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### Resumo estatístico de campos Categóricos

In [6]:
df.describe(include='O')

,Name,Sex,Ticket,Cabin,Embarked
count,891,891,891,204,889
unique,891,2,681,147,3
top,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",male,CA. 2343,C23 C25 C27,S
freq,1,577,7,4,644

In [7]:
df.rename({'Name':'Nome','Sex':'Sexo'}, axis=1, inplace=True)

In [8]:
df.head()

,PassengerId,Survived,Pclass,Nome,Sexo,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Nome', 'Sexo', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
df.columns = ['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade',
              'IrmaosConjuge', 'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine', 'Embarque']

In [11]:
df.head(2)

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [12]:
df[['Nome','Sexo','Classe','Tarifa','Idade','Sobreviveu']].head()\
.style.background_gradient(cmap='OrRd')

In [13]:
df['Idade'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Idade, dtype: float64

### Funções matemáticas embutidas

In [14]:
df['Idade'].mean()

29.69911764705882

In [15]:
df['Idade'].sum()

21205.17

In [16]:
df['Idade'].count()

714

In [17]:
df['Idade'].median()

28.0

In [18]:
df['Idade'].mode()

0    24.0
dtype: float64

In [19]:
df['Idade'].max()

80.0

In [20]:
df['Idade'].min() * 12

5.04

In [21]:
df['Idade'].idxmax()

630

In [22]:
df['Idade'].idxmin()

803

In [23]:
df.mean()

IdPassageiro     446.000000
Sobreviveu         0.383838
Classe             2.308642
Idade             29.699118
IrmaosConjuge      0.523008
PaisFilhos         0.381594
Tarifa            32.204208
dtype: float64

In [24]:
df.min()

IdPassageiro                       1
Sobreviveu                         0
Classe                             1
Nome             Abbing, Mr. Anthony
Sexo                          female
Idade                           0.42
IrmaosConjuge                      0
PaisFilhos                         0
Bilhete                       110152
Tarifa                             0
dtype: object

In [25]:
df.max()

IdPassageiro                             891
Sobreviveu                                 1
Classe                                     3
Nome             van Melkebeke, Mr. Philemon
Sexo                                    male
Idade                                     80
IrmaosConjuge                              8
PaisFilhos                                 6
Bilhete                            WE/P 5735
Tarifa                               512.329
dtype: object

In [26]:
df.iloc[df['Idade'].idxmax()]

IdPassageiro                                      631
Sobreviveu                                          1
Classe                                              1
Nome             Barkworth, Mr. Algernon Henry Wilson
Sexo                                             male
Idade                                              80
IrmaosConjuge                                       0
PaisFilhos                                          0
Bilhete                                         27042
Tarifa                                             30
Cabine                                            A23
Embarque                                            S
Name: 630, dtype: object

In [27]:
df.iloc[df['Idade'].idxmin()]

IdPassageiro                                 804
Sobreviveu                                     1
Classe                                         3
Nome             Thomas, Master. Assad Alexander
Sexo                                        male
Idade                                       0.42
IrmaosConjuge                                  0
PaisFilhos                                     1
Bilhete                                     2625
Tarifa                                    8.5167
Cabine                                       NaN
Embarque                                       C
Name: 803, dtype: object

### Selecionando pelo Index - iloc

In [28]:
df.iloc[[df['Idade'].idxmin()]]

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C

In [29]:
df.iloc[[df['Idade'].idxmax()]]

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

### Operador de seleção "loc"

In [30]:
df[['Nome','Sexo','Classe','Tarifa','Idade','Sobreviveu']].loc[df['Sexo']=='male']

                               Nome  Sexo  Classe   Tarifa  Idade  Sobreviveu
0           Braund, Mr. Owen Harris  male       3   7.2500   22.0           0
4          Allen, Mr. William Henry  male       3   8.0500   35.0           0
5                  Moran, Mr. James  male       3   8.4583    NaN           0
6           McCarthy, Mr. Timothy J  male       1  51.8625   54.0           0
7    Palsson, Master. Gosta Leonard  male       3  21.0750    2.0           0
..                              ...   ...     ...      ...    ...         ...
883   Banfield, Mr. Frederick James  male       2  10.5000   28.0           0
884          Sutehall, Mr. Henry Jr  male       3   7.0500   25.0           0
886           Montvila, Rev. Juozas  male       2  13.0000   27.0           0
889           Behr, Mr. Karl Howell  male       1  30.0000   26.0           1
890             Dooley, Mr. Patrick  male       3   7.7500   32.0           0

[577 rows x 6 columns]

In [31]:
df[['Nome','Sexo','Classe','Tarifa','Idade','Sobreviveu']].loc[df['Sexo']=='female']

,Nome,Sexo,Classe,Tarifa,Idade,Sobreviveu
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,71.2833,38.0,1
2,"Heikkinen, Miss. Laina",female,3,7.9250,26.0,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,53.1000,35.0,1
8,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,3,11.1333,27.0,1
9,"Nasser, Mrs. Nicholas (Adele Achem)",female,2,30.0708,14.0,1
...,...,...,...,...,...,...
880,"Shelley, Mrs. William (Imanita Parrish Hall)",female,2,26.0000,25.0,1
882,"Dahlberg, Miss. Gerda Ulrika",female,3,10.5167,22.0,0
885,"Rice, Mrs. William (Margaret Norton)",female,3,29.1250,39.0,0
887,"Graham, Miss. Margaret Edith",female,1,30.0000,19.0,1
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,3,23.4500,NaN,0

### Selecionando com múltiplas condições

In [32]:
df[['Nome','Sexo','Classe','Tarifa','Idade','Sobreviveu']]\
.loc[(df['Idade']>=3) & (df['Idade']<=10) & (df['Sobreviveu']==1)]

,Nome,Sexo,Classe,Tarifa,Idade,Sobreviveu
10,"Sandstrom, Miss. Marguerite Rut",female,3,16.7000,4.0,1
43,"Laroche, Miss. Simonne Marie Anne Andree",female,2,41.5792,3.0,1
58,"West, Miss. Constance Mirium",female,2,27.7500,5.0,1
165,"Goldsmith, Master. Frank John William ""Frankie""",male,3,20.5250,9.0,1
184,"Kink-Heilmann, Miss. Luise Gretchen",female,3,22.0250,4.0,1
193,"Navratil, Master. Michel M",male,2,26.0000,3.0,1
233,"Asplund, Miss. Lillian Gertrud",female,3,31.3875,5.0,1
237,"Collyer, Miss. Marjorie ""Lottie""",female,2,26.2500,8.0,1
261,"Asplund, Master. Edvin Rojj Felix",male,3,31.3875,3.0,1
348,"Coutts, Master. William Loch ""William""",male,3,15.9000,3.0,1
407,"Richards, Master. William Rowe",male,2,18.7500,3.0,1
445,"Dodge, Master. Washington",male,1,81.8583,4.0,1
448,"Baclini, Miss. Marie Catherine",female,3,19.2583,5.0,1
489,"Coutts, Master. Eden Leslie ""Neville""",male,3,15.9000,9.0,1
535,"Hart, Miss. Eva Miriam",female,2,26.2500,7.0,1
549,"Davies, Master. John Morgan Jr",male,2,36.7500,8.0,1
618,"Becker, Miss. Marion Louise",female,2,39.0000,4.0,1
691,"Karun, Miss. Manca",female,3,13.4167,4.0,1
720,"Harper, Miss. Annie Jessie ""Nina""",female,2,33.0000,6.0,1
750,"Wells, Miss. Joan",female,2,23.0000,4.0,1
751,"Moor, Master. Meier",male,3,12.4750,6.0,1
777,"Emanuel, Miss. Virginia Ethel",female,3,12.4750,5.0,1
869,"Johnson, Master. Harold Theodor",male,3,11.1333,4.0,1

In [33]:
df[['Nome','Sexo','Classe','Tarifa','Idade','Sobreviveu']]\
.loc[(df['Idade']>=3) & (df['Idade']<=10) & ~(df['Sobreviveu']==1)]\
.style.background_gradient(cmap='OrRd')

In [34]:
df[['Nome','Sexo','Classe','Idade']]\
.loc[(df['Idade']>=14) \
     & (df['Sexo']=='male') \
     & (df['Classe']==3)].count()

Nome      228
Sexo      228
Classe    228
Idade     228
dtype: int64

In [35]:
df[['Nome','Sexo','Classe','Idade','Sobreviveu']]\
.loc[(df['Idade']>=14) \
     & (df['Sobreviveu']==1) \
     & (df['Sexo']=='male') \
     & (df['Classe']==3)].count()

Nome          29
Sexo          29
Classe        29
Idade         29
Sobreviveu    29
dtype: int64

In [36]:
df[['Nome','Sexo','Classe','Idade']]\
.loc[(df['Idade']>=14) \
     & (df['Sexo']=='female') \
     & (df['Classe']==3)].count()

Nome      78
Sexo      78
Classe    78
Idade     78
dtype: int64

In [37]:
df[['Nome','Sexo','Classe','Idade','Sobreviveu']]\
.loc[(df['Idade']>=14) \
     & (df['Sobreviveu']==1) \
     & (df['Sexo']=='female') \
     & (df['Classe']==3)].count()

Nome          35
Sexo          35
Classe        35
Idade         35
Sobreviveu    35
dtype: int64

### Map e Replace

In [38]:
df['Sexo'].map({'male':'homem', 'female':'mulher'}).head()

0     homem
1    mulher
2    mulher
3    mulher
4     homem
Name: Sexo, dtype: object

In [39]:
df['Sexo'].replace({'male':'homem', 'female':'mulher'}).head()

0     homem
1    mulher
2    mulher
3    mulher
4     homem
Name: Sexo, dtype: object

In [40]:
df['Sexo'].replace(['male','female'],'pessoa').head()

0    pessoa
1    pessoa
2    pessoa
3    pessoa
4    pessoa
Name: Sexo, dtype: object

In [41]:
df['Sexo'].replace('male','homem').head()

0     homem
1    female
2    female
3    female
4     homem
Name: Sexo, dtype: object

In [42]:
df['Sexo'].replace('female','mulher').head()

0      male
1    mulher
2    mulher
3    mulher
4      male
Name: Sexo, dtype: object

In [43]:
df['Sexo'].replace(['male','female'],['homem','mulher'], inplace=False)

0       homem
1      mulher
2      mulher
3      mulher
4       homem
        ...
886     homem
887    mulher
888    mulher
889     homem
890     homem
Name: Sexo, Length: 891, dtype: object

In [44]:
df['Sexo'].head()

0      male
1    female
2    female
3    female
4      male
Name: Sexo, dtype: object

In [45]:
df['Sexo'] = df['Sexo'].map({'male':'homem', 'female':'mulher'})
df['Sexo']

0       homem
1      mulher
2      mulher
3      mulher
4       homem
        ...
886     homem
887    mulher
888    mulher
889     homem
890     homem
Name: Sexo, Length: 891, dtype: object

### Groupby - Agrupar por

In [46]:
df.groupby('Sexo')

In [47]:
df.groupby('Sexo').count()

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
Sexo,,,,,,,,,,,
homem,577,577,577,577,453,577,577,577,577,107,577
mulher,314,314,314,314,261,314,314,314,314,97,312

In [48]:
df.groupby('Sexo').mean()

,IdPassageiro,Sobreviveu,Classe,Idade,IrmaosConjuge,PaisFilhos,Tarifa
Sexo,,,,,,,
homem,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893
mulher,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818

In [49]:
df.groupby('Sobreviveu').mean()

,IdPassageiro,Classe,Idade,IrmaosConjuge,PaisFilhos,Tarifa
Sobreviveu,,,,,,
0,447.016393,2.531876,30.626179,0.553734,0.329690,22.117887
1,444.368421,1.950292,28.343690,0.473684,0.464912,48.395408

In [50]:
df.groupby('Classe').mean()

,IdPassageiro,Sobreviveu,Idade,IrmaosConjuge,PaisFilhos,Tarifa
Classe,,,,,,
1,461.597222,0.629630,38.233441,0.416667,0.356481,84.154687
2,445.956522,0.472826,29.877630,0.402174,0.380435,20.662183
3,439.154786,0.242363,25.140620,0.615071,0.393075,13.675550

In [51]:
df.groupby(['Sexo','Classe']).mean().style.background_gradient(cmap='OrRd')

### Crosstab

In [52]:
pd.crosstab(df['Sobreviveu'], df['Classe'], margins=True)\
.style.background_gradient(cmap='OrRd')

In [53]:
pd.crosstab(df['Sobreviveu'], df['Sexo'], margins=True)\
.style.background_gradient(cmap='Blues')

### Ordenando Dados

In [54]:
df[['Idade','Sexo','Classe','Sobreviveu']]\
.sort_values('Idade', ascending=False).head()\
.style.background_gradient(cmap='OrRd')

In [55]:
df[['Idade','Sexo','Classe','Sobreviveu']]\
.sort_index(ascending=True).head()\
.style.background_gradient(cmap='OrRd')

### Lidando com dados faltando $\rightarrow$ NaN - Not a Number

In [56]:
df.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           2
dtype: int64

In [57]:
df.loc[df['Embarque'].isnull()]

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
61,62,1,1,"Icard, Miss. Amelie",mulher,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",mulher,62.0,0,0,113572,80.0,B28,NaN

In [58]:
df['Embarque'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [59]:
df['Embarque'].mode()

0    S
dtype: object

In [60]:
df.describe(include='O')

,Nome,Sexo,Bilhete,Cabine,Embarque
count,891,891,891,204,889
unique,891,2,681,147,3
top,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",homem,CA. 2343,C23 C25 C27,S
freq,1,577,7,4,644

In [61]:
df['Embarque'].fillna('S', inplace=False).isnull().sum()

0

In [62]:
df.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           2
dtype: int64

In [63]:
df.loc[df['Embarque'].isnull()].index.values

array([ 61, 829], dtype=int64)

In [64]:
df['Embarque'].at[61]

nan

In [65]:
df['Embarque'].at[829]

nan

In [66]:
df['Embarque'].at[61] = 'S'
df['Embarque'].at[61]

'S'

In [67]:
df['Embarque'].at[829] = 'Q'
df['Embarque'].at[829]

'Q'

In [68]:
df.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           0
dtype: int64

In [69]:
df.drop('Cabine', axis=1, inplace=True)
df.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Embarque           0
dtype: int64

### Apply e Lambda

In [70]:
df['Bilhete'].sort_values()

504         110152
257         110152
759         110152
262         110413
558         110413
          ...
235     W./C. 6609
92     W.E.P. 5734
219      W/C 14208
540      WE/P 5735
745      WE/P 5735
Name: Bilhete, Length: 891, dtype: object

In [71]:
df['Bilhete'] = df['Bilhete'].apply(lambda x: x[:-1])
df['Bilhete'].sort_values()

504         11015
257         11015
759         11015
262         11041
585         11041
          ...
436     W./C. 660
92     W.E.P. 573
219      W/C 1420
745      WE/P 573
540      WE/P 573
Name: Bilhete, Length: 891, dtype: object

### Variáveis Dummy | HotEncoder

In [76]:
df = pd.get_dummies(df, columns=['Sexo'], drop_first=True)
df.head()

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque,Sexo_mulher
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C,1
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,S,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,S,0

In [79]:
df_embarque = pd.get_dummies(df['Embarque'], drop_first=True)
df_embarque.head()

   Q  S
0  0  1
1  0  0
2  0  1
3  0  1
4  0  1

In [80]:
df.head()

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque,Sexo_mulher
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C,1
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,S,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,S,0

### Concatenando DataFrames

In [81]:
df.shape, df_embarque.shape

((891, 11), (891, 2))

In [82]:
df = pd.concat([df, df_embarque], axis=1)
df.head()

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque,Sexo_mulher,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,S,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,S,1,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,S,1,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,S,0,0,1

In [84]:
df.shape

(891, 13)

In [85]:
df.drop('Embarque', axis=1, inplace=True)
df.head()

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Sexo_mulher,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,1,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,1,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,0,0,1

In [86]:
df.shape

(891, 12)

### Engenharia de Recursos (Feature Engineering)

In [87]:
df['Nome']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Nome, Length: 891, dtype: object

In [93]:
df['Titulo'] = df['Nome'].str.extract('([a-zA-Z]+)\.')
df.head()

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Sexo_mulher,Q,S,Titulo
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,0,0,1,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,1,0,0,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,1,0,1,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,1,0,1,Mrs
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,0,0,1,Mr

In [95]:
df['Sexo'] = df['Sexo_mulher'].map({0:'homem', 1:'mulher'})

In [96]:
pd.crosstab(df['Titulo'], df['Sexo'])

Sexo      homem  mulher
Titulo
Capt          1       0
Col           2       0
Countess      0       1
Don           1       0
Dr            6       1
Jonkheer      1       0
Lady          0       1
Major         2       0
Master       40       0
Miss          0     182
Mlle          0       2
Mme           0       1
Mr          517       0
Mrs           0     125
Ms            0       1
Rev           6       0
Sir           1       0

In [100]:
df['Titulo'] = df['Titulo']\
.apply(lambda x: 'Outros' if x not in ['Master','Miss','Mr','Mrs'] else x)

In [101]:
pd.crosstab(df['Titulo'], df['Sexo'])

Sexo    homem  mulher
Titulo
Master     40       0
Miss        0     182
Mr        517       0
Mrs         0     125
Outros     20       7

In [103]:
df[['Titulo', 'Sexo','Idade','Classe','Sobreviveu']]\
.loc[df['Titulo']=='Master'].mean()

Idade         4.574167
Classe        2.625000
Sobreviveu    0.575000
dtype: float64

In [105]:
df_cabine = pd.read_csv('CSVs/titanic/train.csv')
df_cabine['Cabin'].head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [106]:
for idx, _ in df_cabine[['Cabin']].dropna().iterrows():
    df_cabine['Cabin'].at[idx] = df_cabine['Cabin'].at[idx][0]

In [107]:
df_cabine['Cabin']

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: Cabin, Length: 891, dtype: object

In [108]:
df_cabine[['Cabin','Survived','Sex','Pclass']]\
.dropna().groupby('Cabin').mean()

       Survived    Pclass
Cabin
A      0.466667  1.000000
B      0.744681  1.000000
C      0.593220  1.000000
D      0.757576  1.121212
E      0.750000  1.312500
F      0.615385  2.384615
G      0.500000  3.000000
T      0.000000  1.000000

In [109]:
df_cabine.loc[df_cabine['Cabin']=='T']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
339,340,0,1,"Blackwell, Mr. Stephen Weart",male,45.0,0,0,113784,35.5,T,S

In [110]:
df_cabine.loc[df_cabine['Cabin']=='T'].count()

PassengerId    1
Survived       1
Pclass         1
Name           1
Sex            1
Age            1
SibSp          1
Parch          1
Ticket         1
Fare           1
Cabin          1
Embarked       1
dtype: int64